Autodesk.Revit.DB.AssemblyInstance.IsPrecastAssembly
Identifies if the assembly is made by Precast addin.
Returns:
True if the assembly contains Precast data, false otherwise.
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.SetTransform(Autodesk.Revit.DB.Transform)
Sets the origin of the assembly instance.
trf:
Transform to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
trf is not a rigid body transformation.
Since:
2013

Autodesk.Revit.DB.AssemblyInstance.CompareAssemblyInstances(Autodesk.Revit.DB.AssemblyInstance,Autodesk.Revit.DB.AssemblyInstance)
Compares two assembly instances and returns a result with details about the differences
Remarks:
Only the first found difference is returned.
If the instances are identical, AssemblyDifferenceNone will be returned.
instance1:
The first assembly instance to compare
instance2:
the second assembly instance to compare
Returns:
An object describing the difference between the two instances
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.IsMember(Autodesk.Revit.DB.ElementId)
Determines whether the given ElementId is a member of this assembly
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.AssemblyInstance.RemoveMemberIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Removes member element ids from the assembly instance.
memberIds:
Element ids to be removed from the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be removed from the assembly instance.
Provided set should not be empty and all elements should be a member of the assembly instance.
-or-
The provided set includes one or more element ids that cannot be added to or removed from the assembly on their own.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.AddMemberIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Adds member element ids for the assembly instance.
memberIds:
Element ids to be added to the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for membership in the assembly instance.
Elements should be of a valid category and should not be a member of an existing assembly.
-or-
The provided set includes one or more element ids that cannot be added to or removed from the assembly on their own.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.SetMemberIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets member element ids for the assembly instance. All existing members are cleared.
memberIds:
Element ids to set for the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.IsValidNamingCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Identifies if the naming category is valid for an assembly instance.
document:
The document for the assembly instance.
namingCategoryId:
The id of the naming category for the assembly instance.
assemblyMemberIds:
Member ids to check validity of naming category
Returns:
True if the naming category is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.CanRemoveElementsFromAssembly(Autodesk.Revit.DB.AssemblyInstance,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Identifies if provided assembly members can be removed from the assembly instance.
assemblyInstance:
The assembly instance to remove elements from.
memberIds:
Element ids to be tested for validity to remove from the assembly instance.
Returns:
True if all member ids are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.AreElementsValidForAssembly(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Identifies if provided assembly members are valid.
document:
The document.
assemblyMemberIds:
Element ids to be tested for validity for membership of an assembly instance.
assemblyId:
Id of the existing assembly to add components to. If invalid, the method return whether the components can be added to a new assembly
Returns:
True if all member ids are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.PlaceInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Places an assembly instance of a given assembly type at the specified location.
document:
The document for the new assembly instance.
assemblyTypeId:
The id of the assembly type to be used for the instance.
location:
The placement location for the instance in project coordinates.
Returns:
The newly created assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Creates a new assembly instance.
Remarks:
Transaction must be committed after calling this method before performing any action on the newly created instance.
Assembly type is assigned after the transaction for creating assembly instance is complete.
document:
The document containing the elements.
assemblyMemberIds:
The elements that comprise the assembly.
namingCategoryId:
The naming category for the assembly instance.
Returns:
The newly created assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted for membership in the assembly instance.
Elements should be of a valid category and should not be a member of an existing assembly.
-or-
This naming category was not valid for an assembly instance containing the proposed members.
The naming category should match one of the member element categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.AssemblyTypeName
The name for the assembly type.
All matching assembly instances share this name.
Unique assembly instances are named automatically based on their naming category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: This assembly type name is not valid for this assembly instance.
An assembly type name should be non-empty, should contain valid characters, and should be unique for its naming category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.AssemblyInstance.NamingCategoryId
Id of the category that drives the default naming scheme for the assembly instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: This naming category was not valid for an assembly instance containing the proposed members.
The naming category should match one of the member element categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012